load-tests/phases/load.yml
# load-tests/phases/load.yml
# Carga Normal — calibrado para servidor único de desenvolvimento
# Representa ~200 utilizadores simultâneos (3% dos 6000)
# Para testes de produção multi-instância usar arrivalRate: 50-100
# Uso: npm run test:load

config:
  phases:
    - name: "Aquecimento"
      duration: 60
      arrivalRate: 3
      maxVusers: 50

    # arrivalRate 8/s × sessões de ~25-30s ≈ 200-240 VUs concorrentes.
    # Calibrado para não exceder maxVusers (evita vusers.skipped em massa)
    # e para um ritmo de logins realista: numa empresa de 6000, os inícios
    # de sessão distribuem-se — não chegam 20/s sustentados a uma só instância.
    - name: "Carga Normal (~200 VUs)"
      duration: 180
      arrivalRate: 8
      maxVusers: 250

    - name: "Descida"
      duration: 60
      arrivalRate: 3
      maxVusers: 50

  ensure:
    p95: 15000     # localhost dev: 150 VUs gera 10-15s (normal em single-server local)
    p99: 30000     # para p95/p99 < 3s/8s usar staging/produção
    maxErrorRate: 5